<script setup>
//
</script>

<template>
  <div class="main-container">
    <div class="about-header d-flex align-center justify-space-between">
      <div class="breadcrumbs"><span>Главная /</span> О нас</div>
    </div>

    <div class="lk-main d-flex align-start h-100">
      <div class="text-block">
        <div class="text-title">Наша история</div>

        <div class="text-text">
          <p>
            Мы — команда энтузиастов, которая верит в то, что каждая покупка
            может быть не только приятной, но и выгодной. Наша история началась
            с простой идеи: почему бы не наградить людей за то, что они уже
            делают каждый день? Ведь покупки — это не просто рутина, это способ
            выражения себя, заботы о близких и поддержки любимых брендов.
          </p>
          <p>
            Как все начиналось <br />
            В 2018 году несколько друзей, устав от однообразных программ
            лояльности, решили создать что-то особенное. Мы заметили, что
            большинство магазинов предлагают стандартные бонусы или кэшбэк, но
            мало кто действительно вдохновляет своих клиентов. Так появился наш
            сервис — платформа, которая не только вознаграждает за покупки, но и
            превращает этот процесс в настоящее приключение.
          </p>
          <p>
            Первый прототип был запущен в небольшом формате: мы сотрудничали с
            несколькими локальными магазинами и предлагали пользователям
            уникальные бонусы за отзывы о товарах. Идея быстро завоевала
            популярность, ведь люди любят делиться своими впечатлениями и
            получать за это благодарность.
          </p>
          <p>
            Что движет нами сегодня
            <br />
            Сегодня наш сервис вырос в полноценную экосистему, объединяющую
            тысячи пользователей и сотни партнеров. Мы работаем с крупнейшими
            магазинами и брендами, чтобы предложить вам максимально выгодные
            условия. Но главное — мы остаемся верны своей миссии: помогать людям
            находить лучшие товары, делиться честными отзывами и получать за это
            достойное вознаграждение.
          </p>
          <p>
            Наша философия <br />
            Мы верим, что доверие — это основа всего. Именно поэтому мы строим
            наши отношения с пользователями на принципах прозрачности, честности
            и взаимного уважения. Каждый ваш отзыв помогает другим покупателям
            сделать осознанный выбор, а каждая покупка — поддерживает любимые
            бренды. Мы просто добавляем немного магии, чтобы этот процесс стал
            еще приятнее.
          </p>
          <p>
            Почему выбирают нас? <br />
            Простота: Никаких сложных схем. Просто покупайте, пишите отзывы и
            получайте бонусы.<br />
            Выгода: Мы предлагаем одни из самых щедрых условий для наших
            пользователей.<br />
            Разнообразие: От маленьких локальных магазинов до крупных
            международных брендов — у нас есть предложения для всех.<br />
            Инновации: Мы постоянно развиваемся, внедряя новые технологии и
            улучшая ваш опыт.<br />
          </p>
          <p>
            Наши планы на будущее <br />
            Мы только начинаем свой путь. Впереди — расширение географии работы,
            новые партнерства и уникальные программы поощрений. Мы мечтаем о
            том, чтобы стать частью жизни каждого покупателя, который ценит
            качество, честность и выгоду.
          </p>
          <p>
            Присоединяйтесь к нам <br />
            Станьте частью нашего сообщества, где каждый ваш шаг в мире покупок
            приносит пользу. Мы рады видеть вас среди тех, кто меняет правила
            игры вместе с нами!
          </p>
        </div>
      </div>
    </div>

    <div class="cards">
      <div class="card">
        <div class="icon"></div>
        <div class="text">
          <div class="count">10.5k</div>
          <div class="text-text">Оставленных отзывов</div>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.main-container {
  min-height: 90dvh;
  padding: 0 80px;
  display: flex;
  flex-direction: column;
  gap: 40px;

  .cards {
    display: inline-flex;
    align-items: flex-start;
    gap: 30px;
    .card {
      display: flex;
      padding: 30px 44px 30px 50px;
      justify-content: flex-end;
      align-items: center;
      border-radius: 4px;
      border: 1px solid rgba(0, 0, 0, 0.3);
    }
  }
}
.lk-main {
  .text-block {
    .text-title {
      color: #000;
      text-align: justify;

      font-family: "Inter";
      font-size: 54px;
      font-style: normal;
      font-weight: 600;
      line-height: 64px; /* 118.519% */
      letter-spacing: 3.24px;
    }
  }
}
.about-header {
  @include innerHeader;
}
</style>
